print ( 'Шляпка гриба, покрытая … кожиц..й, держится на … ножк.. . Снизу шляпка затянута … плёнкой. Когда её уберёшь, откроется нижняя … сторона шляпк.. .')

a = input ( 'ввести недостающее первое слово («покрытая …»)' )
b = input ( ' ввести с клавиатуры недостающую первую букву  («кожиц..й») ')
c = input (' ввести недостающее слово («на …»)')
d = input ( ' ввести с клавиатуры недостающую первую букву («ножк..») ')
e = input ( 'ввести недостающее слово («затянута … »)' )
f = input ( 'ввести недостающее слово («нижняя … »)' )
g = input ( ' ввести с клавиатуры недостающую первую букву  («шляпк..») ')

print ( ' Шляпка гриба, (a) (b), держится (c) (d) . Снизу шляпка (e) плёнкой. Когда её уберёшь, откроется (f) сторона (g) .')
           